app/controllers/conversations_controller.rb

SELECT "conversations".* FROM "conversations"
---
  def index
    @conversations = Conversation.all

INSERT INTO "conversations" ("user_id1", "user_id2", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id1", 1], ["user_id2", 2], ["created_at", 2017-01-14 15:15:26 UTC], ["updated_at", 2017-01-14 15:15:26 UTC]]
---
  def create
    @conversation = Conversation.new(conversation_params)

    respond_to do |format|
      if @conversation.save

UPDATE "conversations" SET "user_id1" = ?, "user_id2" = ?, "updated_at" = ? WHERE "conversations"."id" = ?  [["user_id1", 4], ["user_id2", 1], ["updated_at", 2017-01-14 15:15:45 UTC], ["id", 3]]
---
  def update
    respond_to do |format|
      if @conversation.update(conversation_params)

SELECT "conversations".* FROM "conversations" WHERE (user_id1 = '1' OR user_id2 = '1') AND (user_id1 = '3' OR user_id2 = '3')
---
  def search
    if params[:user_id1]
      @conv = Conversation.where("user_id1 = ? OR user_id2 = ?", params[:user_id1], params[:user_id1])

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_conversation
      @conversation = Conversation.find(params[:id])