app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("user_id", "theme_id", "title", "description", "cost", "location", "photo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "user_id" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["user_id", 2], ["updated_at", 2017-01-07 15:31:01 UTC], ["id", 6]]

  def search
    if params[:user_id]
      then
      @courses = Course.where(user_id: params[:user_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."user_id" = ? ORDER BY "courses"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]