app/controllers/demands_controller.rb

  def index
    @demands = Demand.all
---
SELECT "demands".* FROM "demands"

  def create
    @demand = Demand.new(demand_params)

    respond_to do |format|
      if @demand.save
---
INSERT INTO "demands" ("user_id", "theme_id", "title", "description", "cost", "location", "photo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def search
    if params[:user_id]
      then
      @demands = Demand.where(user_id: params[:user_id])
---
SELECT "demands".* FROM "demands" WHERE "demands"."user_id" = ?  [["user_id", 1]]

    def set_demand
      @demand = Demand.find(params[:id])
---
SELECT  "demands".* FROM "demands" WHERE "demands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]