app/controllers/lessons_controller.rb

INSERT INTO "lessons" ("course_origin", "teacher_id", "pupil_id", "origin_id", "date", "location", "cost", "evolution", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @lesson = Lesson.new(lesson_params)

    respond_to do |format|
      if @lesson.save

SELECT "lessons".* FROM "lessons" WHERE "lessons"."teacher_id" = ? AND "lessons"."evolution" = ?  [["teacher_id", 1], ["evolution", 0]]
SELECT "lessons".* FROM "lessons" WHERE "lessons"."pupil_id" = ? AND "lessons"."evolution" = ?  [["pupil_id", 1], ["evolution", 0]]
---
  def lessons_remaining
    if params[:user_id]
      then
      lt = Lesson.where(teacher_id: params[:user_id])
      lest = lt.where(evolution: 0)
      lp = Lesson.where(pupil_id: params[:user_id])
      lesp = lp.where(evolution: 0)