app/controllers/lessons_controller.rb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."teacher_id" = ? AND "lessons"."evolution" = ?  [["teacher_id", 2], ["evolution", 1]]
---
  def courses_taught
    if params[:user_id]
      then
      l = Lesson.where(teacher_id: params[:user_id])
      @lessons = l.where(evolution: 1)

SELECT "lessons".* FROM "lessons" WHERE "lessons"."pupil_id" = ? AND "lessons"."evolution" = ?  [["pupil_id", 1], ["evolution", 1]]
---
  def courses_attended
    if params[:user_id]
      then
      l = Lesson.where(pupil_id: params[:user_id])
      @lessons = l.where(evolution: 1)