app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("conv_id", "user_id", "msg", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["conv_id", 1], ["user_id", 1], ["msg", "A"], ["created_at", 2017-01-14 15:57:33 UTC], ["updated_at", 2017-01-14 15:57:33 UTC]]

  def update
    respond_to do |format|
      if @message.update(message_params)
---
UPDATE "messages" SET "msg" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["msg", "D"], ["updated_at", 2017-01-14 16:04:09 UTC], ["id", 2]]

  def search
    if params[:conv_id]
      @messages = Message.where(conv_id: params[:conv_id]).order("created_at asc")
---
SELECT "messages".* FROM "messages" WHERE "messages"."conv_id" = ? ORDER BY created_at asc  [["conv_id", 1]]