app/controllers/user_verifs_controller.rb

SELECT "user_verifs".* FROM "user_verifs"
---
  def index
    @user_verifs = UserVerif.all

SELECT  "user_verifs".* FROM "user_verifs" WHERE "user_verifs"."code" = ? ORDER BY "user_verifs"."id" ASC LIMIT ?  [["code", "d1c0f79d5133a2b52db838abb5d488d0"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "users" SET "verif" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["verif", 1], ["updated_at", 2017-01-14 20:10:05 UTC], ["id", 10]]
---
  def verif
    if params[:token]
      then
      @uv = UserVerif.where(code: params[:token]).first
      if @uv != nil
        user = User.where(id: @uv.user_id).first
          if user.verif == 0
            @user = user
            user.update(verif: 1)

SELECT  "user_verifs".* FROM "user_verifs" WHERE "user_verifs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_user_verif
      @user_verif = UserVerif.find(params[:id])