app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? ORDER BY "users"."id" ASC LIMIT ?  [["user_name", "hugo"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE (lower(user_name) = 'hugo') AND "users"."password" = ? ORDER BY "users"."id" ASC LIMIT ?  [["password", "bonjour"], ["LIMIT", 1]]
---
  def search
    if params[:user_name]
      then
      user_n = User.where("lower(user_name) = ?", params[:user_name].downcase)
      if params[:password]
        then @user = user_n.where(password: params[:password]).first