app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
        UserVerif.create(user_id: @user.id, code: SecureRandom.hex)
---
INSERT INTO "users" ("first_name", "last_name", "password", "email", "phone_number", "nb_skilly", "birth_date", "location", "photo", "verif", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "user_verifs" ("user_id", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 10], ["code", "d1c0f79d5133a2b52db838abb5d488d0"], ["created_at", 2017-01-14 19:19:23 UTC], ["updated_at", 2017-01-14 19:19:23 UTC]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "verif" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["verif", 0], ["updated_at", 2017-01-14 20:14:56 UTC], ["id", 11]]

  def search
    if params[:email]
      then
      user_n = User.where(email: params[:email]).first
---
SELECT  "users".* FROM "users" WHERE (email = 'hugo@email.com' AND password = 'bonjour') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def set_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE (lower(user_name) = 'hugo') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]